package kr.ac.kopo.day07;

public class 생성자 { //아예 반환값 자체가 없는 것. 클래스 명과 이름이 동일. new라는 키워드를 써줘서 호출이 된다. new를 쓰는 순간 알아서 호출이 됌.클래스 내 jvm이 자동으로 생성자를 생성해준다. 내용도 없고 매개변수도 없는 생성자임.
	/*
	 * 오버로딩이란 동일한 클래스 내에서 메소드이름은 같지만 매개변수 없는 것. 오버로딩을 통해 생성자를 만듬.
	 * 생성자의 가장 큰 특징은 맴버변수를 저장하고 맴버변수를 초기화하는 것이 목적임. 
	 * 멤버변수를 초기화하는게 목적임.
	 * 지역변수는 초기화가 되지 않지만 name의 참조변수는 null이다. 
	 * int는 정수이므로 0으로 초기화되는 것이다.
	 * 생성자가 선언이 되어 있으면 default 
	 * default 생성자는 클래스 내에 생성자가 하나도 없을 때 생성이 된다.
	 * 클래스 내부에서 맴버변수나 생성자를 배웠는데, 멤버변수의 값을 초기화하기위해 생성자를 만든다.
	 * 클래

	 */

}
